src/toir_cfe/src/DataProcessors/проф_ЗагрузкаОбъектовРемонта/проф_ЗагрузкаОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>проф_ЗагрузкаОбъектовРемонта</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/toir_cfe/src/Enums/СпособыСтроительства/СпособыСтроительства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5fbd54c9-ad4a-4147-8009-4ee5b1befa8f">
  <name>СпособыСтроительства</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="0558d129-3d89-4535-b823-e42b39e1c5c6">
    <name>Подрядный</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="43d08372-f824-466a-b828-f37e49508b58">
    <name>Хозспособ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/toir_cfe/src/Catalogs/торо_ОбъектыРемонта/торо_ОбъектыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bc7402bd-d283-40c7-9b61-dde80fafb3d8">
  <name>торо_ОбъектыРемонта</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="213a88d1-10cd-4415-be87-6466d619cd88">
    <name>ТиповойОР</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="47fb0293-feaf-4992-8644-4f79efbe139f">
    <name>Изготовитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0b0e085f-b80a-45ba-8729-f3d02e881457">
    <name>Направление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ea3c21ff-2af7-4916-a866-e5b01c2fea11">
    <name>ДатаВводаВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b5ba0323-3b01-46d2-9bde-8c0207e1cb21">
    <name>ДатаВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9f4d4241-b7f9-404c-96be-63c46d087525">
    <name>ШтрихКод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="99b876ea-2a2a-4f0e-9d42-e4fb5ff631da">
    <name>ТипОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b3a58cb8-2443-4009-b5f6-f4cb4f657cb7">
    <name>ИнвентарныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="db977b56-8d4f-477d-bacd-96c656f0c4e2">
    <name>ЗаводскойНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eebb6ad6-7b6c-4e39-8fe5-992da135c1dd">
    <name>ТехНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="5761f0bd-211f-4da4-82fc-476910d2db04">
    <name>проф_НормативныеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="757bfdf7-b0f2-4ce9-bf65-9a73743034b9">
    <name>проф_ПредшествующиеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="27d1aabe-5590-4b8a-92b6-17540e81adc7">
    <name>проф_ЗамещаемыеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="ee9e378e-a344-4a59-a2a5-054789005c8d">
    <name>проф_ТабличноеПолеРемонтныеЦиклыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f450d93a-cf39-4570-a8cc-896795681912">
    <name>проф_РемЦиклыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="e01b6f5d-fe35-434f-87a5-1ce36557d3e2">
    <name>проф_ТабЗапчастейОбъектовРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="0bdcaf87-2304-461b-9957-e534bec7fb10">
    <name>проф_ТабЗатратПоВидамРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c30740dc-2210-44f4-be97-a6f7b8e216b1">
    <name>проф_ГарантииОбъектаРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Catalog>

src/toir_cfe/src/Catalogs/проф_МоделиТСиОборудования/проф_МоделиТСиОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6d915c4b-efa2-49ca-bb11-e3e51246adcf">
  <name>проф_МоделиТСиОборудования</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="2c982216-ac21-4da9-8925-5f2d72ec41d5">
    <name>ВидМоделиТС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="33e4050c-34a9-4405-987a-4dc348849d4e">
    <name>Одометр</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="30ae6d96-190a-4774-906e-e56ac4e54feb">
    <name>Марка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="119a1bb5-5f58-486a-993d-44d675ec3ed2">
    <name>ТипТС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="24a26eef-8e86-4b64-bdb9-20be2b934be8">
    <name>КатегорияЕЭК</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="76a0ee6f-f2ab-4a65-a5aa-76501feb8386">
    <name>ОсновноеТопливо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="19f4f28d-184e-4dac-8b79-adf0ce4bb15b">
    <name>ДополнительноеТопливо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="62bb6047-cdfc-4d47-9fbf-e6a78c539b5e">
    <name>ТопливныйБак</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="44c28351-a1ca-4eea-8980-fa5cda277f60">
    <name>ОбъемБака</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5239d1af-0fdc-4cf1-ab6c-cdb8ff919f52">
    <name>ТипДвигателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f26ea33e-2876-4d73-9c1f-de2fe624abf7">
    <name>МодельДвигателя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8558bee6-587d-44bf-bb5c-7fe7a39fef58">
    <name>МощностьДвигателяЛС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>8</precision>
          <scale>1</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a2b939a0-8b0c-4c84-8076-caa98ed0b9d9">
    <name>МощностьДвигателяКВТ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>8</precision>
          <scale>1</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5cb1a48c-c85b-4f3b-8d16-0cbf5fac9a21">
    <name>РабочийОбъемДвигателя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>8</precision>
          <scale>1</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="af71fddf-c196-4092-9217-c7916f3d7f07">
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff2dbad0-91cc-438a-b880-5d59b7f1ae6e">
    <name>МаксимальнаяСкорость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="94c18cff-b722-4e3e-bc8a-478b1ce1d73d">
    <name>СобственныйВес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="89c45670-cb86-47b1-8077-bd3b596b49b1">
    <name>Грузоподъемность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="89e84fcf-b329-4635-bde4-f5424dba60ec">
    <name>ОбъемКузова</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dab06d94-b25f-4975-9610-3a5b83176393">
    <name>ВидПривода</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="32f18258-4af2-43bb-9913-57b8b1a0503b">
    <name>КоличествоОсей</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f1bcc7d0-a642-4270-a0b0-cf30ab18b112">
    <name>КоличествоКолес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fb61bb29-6b49-4140-9371-d86e76e4978a">
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9b2d5f85-cb55-44a1-abd2-96bc70d9abcc">
    <name>СидячихМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="da4ba47a-0885-47c1-a82a-6d72ba8baa81">
    <name>СпособПогрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fd67bd92-d6e6-4cfb-a106-08d2fd0afc7b">
    <name>ВысотаДвери</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="697eaef1-95ce-4772-a237-b8d608e20a49">
    <name>ШиринаДвери</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f4a90edc-d483-49b7-a685-a1a44c79d40a">
    <name>Длина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a0d41878-ce38-4866-b077-75a5ad10ca6e">
    <name>Высота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cb4c3c1c-73c4-4db8-8943-6d05274f15b6">
    <name>Ширина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8489c1c8-049e-45a8-834d-6f3ac0e7981f">
    <name>ПолезнаяДлина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1bab7795-e8cb-4759-8e50-5b543dfb56e1">
    <name>ПолезнаяШирина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3666dfee-09f2-4f76-89f7-5c53f12880c5">
    <name>ПолезнаяВысота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

src/toir_cfe/src/DataProcessors/проф_ЗагрузкаОбъектовРемонта/Forms/Форма/Module.bsl
//++ Проф-ИТ, #33, Башинская А., 13.10.2023	

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗагрузить(Команда)  
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ПоказатьПредупреждение(, "Заполните организацию.");    
		Возврат;
	КонецЕсли;
	
	РезультатЗагрузки = "";
	КомандаЗагрузитьНаСервере();
	
	РезультатЗагрузки = СтрШаблон("%1 %2Запись объектов ремонта завершена.", РезультатЗагрузки, Символы.ПС);  
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьНормативыПланирования(ОбъектОР, ОбъектНайден)

	СтруктураИзменения = Новый Структура;
	СтруктураИзменения.Вставить("МодифицированностьПредшествующихРемонтов", Ложь);
	СтруктураИзменения.Вставить("МодифицированностьРемЦиклов", Ложь);
	СтруктураИзменения.Вставить("МодифицированностьЗамещаемыхРемонтов", Ложь);
	СтруктураИзменения.Вставить("МодифицированностьЗапчастейОР", Ложь);
	СтруктураИзменения.Вставить("МодифицированностьНормативныхЗатратПоЗапчастям", Ложь);
	СтруктураИзменения.Вставить("МодифицированностьГарантий", Ложь);
	СтруктураИзменения.Вставить("МодифицированностьНормРемонтов", Ложь);
	
	Отказ = Ложь;
	Если ОбъектНайден Тогда 
		ТекТиповойОР  = ОбъектОР.ТиповойОР;
		ПредТиповойОР = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектОР.Ссылка, "ТиповойОР");
	Иначе
		ТекТиповойОР  = Справочники.торо_ТиповыеОР.ПустаяСсылка();         
		ПредТиповойОР = Справочники.торо_ТиповыеОР.ПустаяСсылка(); 
	КонецЕсли;
		
	ОбъектОР.ОбновитьТехническиеДанные(ТекТиповойОР, СтруктураИзменения);
	ОбъектОР.ПроверитьЗаполнитьНаСервере(СтруктураИзменения, Отказ);
	ОбъектОР.ПередЗаписьюФормы(СтруктураИзменения, Отказ);
	ОбъектОР.ПриЗаписиФормы(СтруктураИзменения, ПредТиповойОР, Отказ);
		
КонецПроцедуры

// Процедура записывает логи о загрузке данных из файла для последующего вывода
// Параметры:
// ТекстСообщения - текст записываемого сообщения
// НомерСтроки - по данной строке идет запись сообщений
// Приоритет - 1 - ошибка, 2 - предупреждение, 3 - общая информация, 4 - итоговое сообщение
//
&НаСервере
Процедура ЗаписатьСообщение(ТекстСообщения, НомерСтроки, Приоритет)
	
	НСтр = ТаблицаСообщенийПоСтрокам.Добавить();
	НСтр.Сообщение = ТекстСообщения;
	НСтр.Номер = НомерСтроки;
	НСтр.Приоритет = Приоритет;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиРезультатыЗагрузки()
	
	ТаблицаСообщенийПоСтрокам.Сортировать("Номер, Приоритет");   
	ПредСтрока = Неопределено;
	Для Каждого Стр Из ТаблицаСообщенийПоСтрокам Цикл
		Если ПредСтрока <> Неопределено
		И Стр.Номер <> ПредСтрока.Номер Тогда
			РезультатЗагрузки = РезультатЗагрузки + Символы.ПС; 
		КонецЕсли; 
		
		РезультатЗагрузки = РезультатЗагрузки + Стр.Сообщение + Символы.ПС;   
		
		ПредСтрока = Стр;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура КомандаЗагрузитьНаСервере()
	
	СообщениеОшибки = ""; 
	СообщенияЗагрузки = "";     
	СообщенияПредупреждения = "";
	ЕстьНезаполненныеЗначения = Ложь;
	МассивОбязательныхКолонок = ПолучитьСписокОбязательныхКолонок();
	МассивЭлементовСправочника = Новый Соответствие;
	СтрокиИзФайла.Очистить();
	ТаблицаСообщенийПоСтрокам.Очистить();
	
	Для НомерСтроки = 2 По ТабличныйДокумент.ВысотаТаблицы Цикл 
			
		СтрПоля = "";
		Для Каждого Элемент Из МассивОбязательныхКолонок Цикл
			Если ТабличныйДокумент.Область(НомерСтроки, Элемент).Текст = "" Тогда
				СтрПоля = СтрШаблон("%1%2; ", СтрПоля, ТабличныйДокумент.Область(1, Элемент).Текст);
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(СтрПоля) Тогда
			ЕстьНезаполненныеЗначения = Истина;
			Смещение = 2;         
			СтрПоля = Лев(СтрПоля, СтрДлина(СтрПоля) - Смещение);
			       
			СообщенияПредупреждения = СтрШаблон("Не заполнены обязательные поля в строке №%1 (%2)", НомерСтроки, СтрПоля);			
			ЗаписатьСообщение(СообщенияПредупреждения, НомерСтроки, 2);
        КонецЕсли;
		
		НСтр = СтрокиИзФайла.Добавить();
		НСтр.НомерСтроки = НомерСтроки;
		НСтр.ОбъектРемонта								=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 1).Текст);
		НСтр.НаименованиеОР								=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 2).Текст);
		НСтр.КодРодителя								=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 3).Текст);
		НСтр.НаименованиеРодителя						=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 4).Текст);
		НСтр.ДатаВводаВЭксплуатацию 					=  СтрокаВДату(СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 5).Текст));  	
		НСтр.ДатаВыпуска								=  СтрокаВДату(СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 6).Текст));	
		НСтр.Приоритет									=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 7).Текст); 
		НСтр.АдресМестонахождения						=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 8).Текст);
		НСтр.ЗаводскойНомер								=  Сокрлп(ТабличныйДокумент.Область(НомерСтроки, 9).Текст); 
		НСтр.Изготовитель								=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 10).Текст);
		НСтр.ИнвентарныйНомер 							=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 11).Текст);  
		НСтр.ТехНомер		 							=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 12).Текст);		
		НСтр.НомерПаспорта   							=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 13).Текст);
		НСтр.ПлановыйГрафикРабот  						=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 14).Текст);
		// Подразделение
		НСтр.КодЭксплуатирующегоПодразделения 	 		=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 15).Текст);
		НСтр.НаименованиеЭксплуатирующегоПодразделения 	=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 16).Текст);
		// Подразделение исполнитель
		НСтр.КодРемонтирующегоПодразделения 			=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 17).Текст);
		НСтр.НаименованиеРемонтирующегоПодразделения 	=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 18).Текст);  
		НСтр.КодТиповогоОР 								=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 19).Текст);
		НСтр.НаименованиеТиповогоОР 					=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 20).Текст);		
		НСтр.Модель										=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 21).Текст);
		НСтр.Марка										=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 22).Текст);
		НСтр.Гараж										=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 23).Текст);
		НСтр.ГаражныйНомер								=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 24).Текст);
		НСтр.ГосНомер									=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 25).Текст);
		НСтр.ВИН										=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 26).Текст);
		НСтр.ЦветКузова									=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 27).Текст);
		НСтр.СобственныйВес								=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 28).Текст);		
		НСтр.Колонна									=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 29).Текст);
		НСтр.ВидЛицензионнойКарточки					=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 30).Текст);
		НСтр.НомерЛицКарточки							=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 31).Текст);
		НСтр.РегистрационныйНомерЛицКарточки			=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 32).Текст);		
		НСтр.СерияЛицКарточки							=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 33).Текст);
		НСтр.НомерДвигателя								=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 34).Текст);
		НСтр.МодельДвигателя							=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 35).Текст);
		НСтр.МощностьДвигателяКВТ						=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 36).Текст);
		НСтр.МощностьДвигателяЛС						=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 37).Текст);
		НСтр.НомерКузова								=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 38).Текст);
		НСтр.НомерШасси									=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 39).Текст);
		НСтр.НомерКПП								    =  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 40).Текст);
		НСтр.ГабаритныйРазмерДлина						=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 41).Текст);
	    НСтр.ГабаритныйРазмерШирина						=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 42).Текст);    
		НСтр.ГабаритныйРазмерВысота						=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 43).Текст); 
		НСтр.ВместимостьВКМ								=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 44).Текст);
		НСтр.ГрузоподъемностьВТоннах					=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 45).Текст);
	    НСтр.ПолезныйРазмерДлина						=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 46).Текст); 
	    НСтр.ПолезныйРазмерШирина						=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 47).Текст);    
		НСтр.ПолезныйРазмерВысота						=  СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 48).Текст);  
		
	КонецЦикла;	
	
	ЗаполнитьПроверитьДанные(МассивЭлементовСправочника, СообщенияЗагрузки, СообщениеОшибки, СообщенияПредупреждения);			
		
	ВывестиРезультатыЗагрузки();
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Загрузка завершена";
	Сообщение.Сообщить();

КонецПроцедуры    

&НаСервере
Функция СтрокаВДату(Знач Значение)   
	
	Значение = СтрЗаменить(Значение, " ", "");
	Значение = СокрЛП(СтрЗаменить(Значение, ".", ""));
	Значение = СокрЛП(СтрЗаменить(Значение, "/", "")); 
	Значение = СокрЛП(СтрЗаменить(Значение, "-", "")); 
	Значение = Сред(Значение, 5) + Сред(Значение, 3, 2) + Лев(Значение, 2);     
	
	Если СтрДлина(Значение) = 6 Тогда 
		Год = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Лев(Значение, 2));
		Если Год = Неопределено Тогда
			Возврат Дата('0001.01.01');
		КонецЕсли; 
		Значение = ?(Год > 29, "19", "20") + Значение; 
	КонецЕсли;     
	
	ОписаниеТипа = Новый ОписаниеТипов("Дата"); 
	Результат    = ОписаниеТипа.ПривестиЗначение(Значение);
	Возврат Результат;  
	
КонецФункции 

&НаСервере
Функция ПолучитьСпособВыполнения(Текст)
	
	Если Текст = "Хозспособ" Тогда
		Возврат Перечисления.СпособыСтроительства.Хозспособ;
	ИначеЕсли Текст = "Подрядный" Тогда
		Возврат Перечисления.СпособыСтроительства.Подрядный;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
																	
&НаСервере
Процедура ВыполнитьЗаписьВБД(СообщенияЗагрузки, МассивЭлементовСправочника)
	
	ОсновнаяСтруктура = Справочники.проф_НастройкиСистемы.ПолучитьНастройкуСистемы(
							"НастройкиОбменаТОИР", "СтруктураИерархииПоУмочанию");
	
	Если ОсновнаяСтруктура = Неопределено
	Или Не ЗначениеЗаполнено(ОсновнаяСтруктура) Тогда
		ОсновнаяСтруктура = ПредопределенноеЗначение("Справочник.торо_СтруктурыОР.ПустаяСсылка");
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка

		// Запишем ссылки
		Для Каждого Эл Из МассивЭлементовСправочника Цикл
			
			СписокЗначенийПоСтроке = Эл.Значение;
			Запись = СписокЗначенийПоСтроке[0].Значение;
			РодительИерархии = СписокЗначенийПоСтроке[1].Значение;
 
			Если Не Запись.Ссылка.Пустая() Тогда           
				
				// Обновим элемент справочника
				ЗаполнитьНормативыПланирования(Запись, Истина);
				Запись.Записать();
				СообщенияЗагрузки = СтрШаблон("Запись строки №%1 обновлена%2", Эл.Ключ, Символы.ПС);
				ЗаписатьСообщение(СообщенияЗагрузки, Эл.Ключ, 3);

			Иначе         
				
				// Запишем новый элемент справочника
				Запись.Записать();
				ЗаполнитьНормативыПланирования(Запись, Ложь);
				
				// Запишем данные в РС
				// торо_ПорядокОРПоИерархии
				СледующийНомерДопУпорядочивания = ПолучитьСледующийНомерДопУпорядочивания(ОсновнаяСтруктура);
				ЗаписьР = РегистрыСведений.торо_ПорядокОРПоИерархии.СоздатьМенеджерЗаписи();
				ЗаписьР.ОбъектРемонта = Запись.Ссылка;
				ЗаписьР.СтруктураИерархии = ОсновнаяСтруктура;
				ЗаписьР.РеквизитДопУпорядочиванияОР = СледующийНомерДопУпорядочивания;
				ЗаписьР.Записать();  
				
				// торо_ИерархическиеСтруктурыОР
				Если ЗначениеЗаполнено(РодительИерархии) Тогда
					ЗаписьР2 = РегистрыСведений.торо_ИерархическиеСтруктурыОР.СоздатьМенеджерЗаписи();
					ЗаписьР2.ОбъектИерархии = Запись.Ссылка;
					ЗаписьР2.СтруктураИерархии = ОсновнаяСтруктура;
					ЗаписьР2.РодительИерархии = РодительИерархии;
					ЗаписьР2.Записать();  
				Иначе        
					СообщенияЗагрузки = СтрШаблон(
						"По строке №%1 не записаны данные в регистр ""Иерархические структуры, т.к. не найден родитель по коду %2",
						Эл.Ключ, Символы.ПС);
					ЗаписатьСообщение(СообщенияЗагрузки, Эл.Ключ, 3);	
				КонецЕсли;
				
				СообщенияЗагрузки = СтрШаблон("Запись строки №%1 загружена%2", Эл.Ключ, Символы.ПС);
				ЗаписатьСообщение(СообщенияЗагрузки, Эл.Ключ, 3);

			КонецЕсли;
			
		КонецЦикла;   
		ЗафиксироватьТранзакцию(); 
	Исключение
		ОтменитьТранзакцию();
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());		
		СообщенияЗагрузки = "Возникли ошибки при записи в базу данных. " + ОписаниеОшибки;   
		ЗаписатьСообщение(СообщенияЗагрузки, 1000000, 4);
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСледующийНомерДопУпорядочивания(ОсновнаяСтруктура)     
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(торо_ПорядокОРПоИерархии.РеквизитДопУпорядочиванияОР) КАК РеквизитДопУпорядочиванияОР,
		|	торо_ПорядокОРПоИерархии.СтруктураИерархии КАК СтруктураИерархии
		|ИЗ
		|	РегистрСведений.торо_ПорядокОРПоИерархии КАК торо_ПорядокОРПоИерархии
		|ГДЕ
		|	торо_ПорядокОРПоИерархии.СтруктураИерархии = &СтруктураИерархии
		|
		|СГРУППИРОВАТЬ ПО
		|	торо_ПорядокОРПоИерархии.СтруктураИерархии";	
	Запрос.УстановитьПараметр("СтруктураИерархии", ОсновнаяСтруктура);
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.РеквизитДопУпорядочиванияОР + 1;
	КонецЦикла;            
	
	Возврат 1;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСправочник(Стр, МассивЭлементовСправочника, ПриоритетПоУмолчанию)
	
	// Создадим запись в регистре торо_НормативныеРемонтыОборудования	
	Если Стр.ОбъектРемонта <> Неопределено
	И Стр.ОбъектРемонтаКолВо = 1
	И ЗначениеЗаполнено(Стр.НаименованиеОР) Тогда		
		ЭлементСправочника = Стр.ОбъектРемонта.ПолучитьОбъект();
	КонецЕсли;	
		
	Если Стр.ОбъектРемонта = Неопределено
	И ЗначениеЗаполнено(Стр.НаименованиеОР) Тогда
		// Элемент не был создан ранее      
		ЭлементСправочника = Справочники.торо_ОбъектыРемонта.СоздатьЭлемент();
		ЭлементСправочника.Код 							= Стр.ОбъектРемонтаКод;
		// Для новых ссылок заполним значения по умолчанию
		ЭлементСправочника.ВестиУчетСерийныхЗапчастей 	= Истина;	  
		ЭлементСправочника.Организация 					= Объект.Организация;
		ЭлементСправочника.ТипОбъекта 					= Перечисления.торо_ТипыОбъектовRCM.Объект;	
	КонецЕсли;
	
#Область ЗаполнениеРеквизитов   

    ЭлементСправочника.Наименование = Стр.НаименованиеОР;  
	Если Стр.Родитель <> Неопределено Тогда
		Родитель = Стр.Родитель;     
	Иначе
		Родитель = Неопределено;
	КонецЕсли;   
	Если Стр.ПлановыйГрафикРабот <> Неопределено Тогда
		ЭлементСправочника.ПлановыйГрафикРаботы = Стр.ПлановыйГрафикРабот;     
	КонецЕсли;     
	Если Стр.Подразделение <> Неопределено Тогда
		ЭлементСправочника.Подразделение = Стр.Подразделение;     
	КонецЕсли;
	Если Стр.РемонтирующееПодразделение <> Неопределено Тогда
		ЭлементСправочника.ПодразделениеИсполнитель = Стр.РемонтирующееПодразделение;     
	КонецЕсли;   
	Если Стр.ТиповойОР <> Неопределено Тогда
		ЭлементСправочника.ТиповойОР = Стр.ТиповойОР;     
	КонецЕсли;    
	Если Стр.Модель <> Неопределено Тогда
		ЭлементСправочника.проф_Модель = Стр.Модель;
	Иначе
		ЭлементСправочника.проф_Модель = Стр.МодельНаименование; // возможна строка в значении
	КонецЕсли;
    Если Стр.Изготовитель <> Неопределено Тогда
		ЭлементСправочника.Изготовитель = Стр.Изготовитель;
	Иначе
		ЭлементСправочника.Изготовитель = Стр.ИзготовительСтр; // возможна строка в значении
	КонецЕсли;
    Если Стр.Приоритет <> Неопределено Тогда
		ЭлементСправочника.Приоритет = Стр.Приоритет;     
	Иначе
		ЭлементСправочника.Приоритет = ПриоритетПоУмолчанию;   
	КонецЕсли; 
	
	ЭлементСправочника.ДатаВводаВЭксплуатацию = Стр.ДатаВводаВЭксплуатацию;    
	ЭлементСправочника.ДатаВыпуска = Стр.ДатаВыпуска;          
	ЭлементСправочника.ТехНомер = Стр.ТехНомер;  
	ЭлементСправочника.АдресМестонахождения = Стр.АдресМестонахождения;  
	ЭлементСправочника.ЗаводскойНомер = Стр.ЗаводскойНомер;    
	ЭлементСправочника.ИнвентарныйНомер = Стр.ИнвентарныйНомер;    
	ЭлементСправочника.НомерПаспорта = Стр.НомерПаспорта;    
	ЭлементСправочника.проф_Марка = Стр.Марка;    
	ЭлементСправочника.проф_Гараж = Стр.Гараж;    
	ЭлементСправочника.проф_ГаражныйНомер = Стр.ГаражныйНомер;    
	ЭлементСправочника.проф_VIN = Стр.ВИН;    
	ЭлементСправочника.проф_Госномер = Стр.ГосНомер;    
	ЭлементСправочника.проф_ЦветКузова = Стр.ЦветКузова;    
	ЭлементСправочника.проф_СобственныйВес = Стр.СобственныйВес;    
	ЭлементСправочника.проф_Колонна = Стр.Колонна;    
	ЭлементСправочника.проф_ЛицензионнаяКарточкаВид = Стр.ВидЛицензионнойКарточки;    
	ЭлементСправочника.проф_ЛицензионнаяКарточкаНомер = Стр.НомерЛицКарточки;    
	ЭлементСправочника.проф_ЛицензионнаяКарточкаРегистрационныйНомер = Стр.РегистрационныйНомерЛицКарточки;    	
	ЭлементСправочника.проф_ЛицензионнаяКарточкаСерия = Стр.СерияЛицКарточки;    
	ЭлементСправочника.проф_НомерДвигателя = Стр.НомерДвигателя;    
	ЭлементСправочника.проф_МодельДвигателя = Стр.МодельДвигателя;    
	ЭлементСправочника.проф_МощностьДвигателяКВт = Стр.МощностьДвигателяКВТ;    
	ЭлементСправочника.проф_МощностьДвигателяЛС = Стр.МощностьДвигателяЛС;    
	ЭлементСправочника.проф_НомерКузова = Стр.НомерКузова;    
	ЭлементСправочника.проф_НомерШасси = Стр.НомерШасси;    
	ЭлементСправочника.проф_НомерКПП = Стр.НомерКПП;       
	ЭлементСправочника.проф_ГабаритныйРазмерДлина = Стр.ГабаритныйРазмерДлина;    
	ЭлементСправочника.проф_ГабаритныйРазмерШирина = Стр.ГабаритныйРазмерШирина;      
	ЭлементСправочника.проф_ГабаритныйРазмерВысота = Стр.ГабаритныйРазмерВысота;    
	ЭлементСправочника.проф_ПолезныйРазмерВысота = Стр.ПолезныйРазмерВысота;    
	ЭлементСправочника.проф_ПолезныйРазмерДлина = Стр.ПолезныйРазмерДлина;      
	ЭлементСправочника.проф_ПолезныйРазмерШирина = Стр.ПолезныйРазмерШирина;    
	ЭлементСправочника.проф_ВместимостьВКубическихМетрах = Стр.ВместимостьВКМ;    
	ЭлементСправочника.проф_ГрузоподъемностьВТоннах = Стр.ГрузоподъемностьВТоннах;    

#КонецОбласти

	СписокЗначенийПоСтроке = Новый СписокЗначений;
	СписокЗначенийПоСтроке.Добавить(ЭлементСправочника);
	СписокЗначенийПоСтроке.Добавить(Родитель);

	МассивЭлементовСправочника.Вставить(Стр.НомерСтроки, СписокЗначенийПоСтроке);
		
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляПроверкиИЗаполнения()
	
	ТЗ = РеквизитФормыВЗначение("СтрокиИзФайла");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВнешнийИсточник.ОбъектРемонта КАК ОбъектРемонта,
	               |	ВнешнийИсточник.НаименованиеОР КАК НаименованиеОР,
	               |	ВнешнийИсточник.НомерСтроки КАК НомерСтроки,
	               |	ВнешнийИсточник.КодРодителя КАК КодРодителя,
	               |	ВнешнийИсточник.НаименованиеРодителя КАК НаименованиеРодителя,
	               |	ВнешнийИсточник.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	               |	ВнешнийИсточник.ДатаВыпуска КАК ДатаВыпуска,
	               |	ВнешнийИсточник.ТехНомер КАК ТехНомер,
	               |	ВнешнийИсточник.Приоритет КАК Приоритет,
	               |	ВнешнийИсточник.АдресМестонахождения КАК АдресМестонахождения,
	               |	ВнешнийИсточник.ЗаводскойНомер КАК ЗаводскойНомер,
	               |	ВнешнийИсточник.ИнвентарныйНомер КАК ИнвентарныйНомер,
	               |	ВнешнийИсточник.НомерПаспорта КАК НомерПаспорта,
	               |	ВнешнийИсточник.ПлановыйГрафикРабот КАК ПлановыйГрафикРабот,
	               |	ВнешнийИсточник.КодЭксплуатирующегоПодразделения КАК КодЭксплуатирующегоПодразделения,
	               |	ВнешнийИсточник.НаименованиеЭксплуатирующегоПодразделения КАК НаименованиеЭксплуатирующегоПодразделения,
	               |	ВнешнийИсточник.КодРемонтирующегоПодразделения КАК КодРемонтирующегоПодразделения,
	               |	ВнешнийИсточник.НаименованиеРемонтирующегоПодразделения КАК НаименованиеРемонтирующегоПодразделения,
	               |	ВнешнийИсточник.КодТиповогоОР КАК КодТиповогоОР,
	               |	ВнешнийИсточник.НаименованиеТиповогоОР КАК НаименованиеТиповогоОР,
	               |	ВнешнийИсточник.Модель КАК Модель,
	               |	ВнешнийИсточник.Марка КАК Марка,
	               |	ВнешнийИсточник.Гараж КАК Гараж,
	               |	ВнешнийИсточник.ГаражныйНомер КАК ГаражныйНомер,
	               |	ВнешнийИсточник.ВИН КАК ВИН,
	               |	ВнешнийИсточник.ГосНомер КАК ГосНомер,
	               |	ВнешнийИсточник.ЦветКузова КАК ЦветКузова,
	               |	ВнешнийИсточник.СобственныйВес КАК СобственныйВес,
	               |	ВнешнийИсточник.Изготовитель КАК ИзготовительСтр,
	               |	ВнешнийИсточник.Колонна КАК Колонна,
	               |	ВнешнийИсточник.ВидЛицензионнойКарточки КАК ВидЛицензионнойКарточки,
	               |	ВнешнийИсточник.НомерЛицКарточки КАК НомерЛицКарточки,
	               |	ВнешнийИсточник.РегистрационныйНомерЛицКарточки КАК РегистрационныйНомерЛицКарточки,
	               |	ВнешнийИсточник.СерияЛицКарточки КАК СерияЛицКарточки,
	               |	ВнешнийИсточник.НомерДвигателя КАК НомерДвигателя,
	               |	ВнешнийИсточник.МодельДвигателя КАК МодельДвигателя,
	               |	ВнешнийИсточник.МощностьДвигателяКВТ КАК МощностьДвигателяКВТ,
	               |	ВнешнийИсточник.МощностьДвигателяЛС КАК МощностьДвигателяЛС,
	               |	ВнешнийИсточник.НомерКузова КАК НомерКузова,
	               |	ВнешнийИсточник.НомерШасси КАК НомерШасси,
	               |	ВнешнийИсточник.НомерКПП КАК НомерКПП,
	               |	ВнешнийИсточник.ГабаритныйРазмерДлина КАК ГабаритныйРазмерДлина,
	               |	ВнешнийИсточник.ГабаритныйРазмерШирина КАК ГабаритныйРазмерШирина,
	               |	ВнешнийИсточник.ГабаритныйРазмерВысота КАК ГабаритныйРазмерВысота,
	               |	ВнешнийИсточник.ПолезныйРазмерВысота КАК ПолезныйРазмерВысота,
	               |	ВнешнийИсточник.ПолезныйРазмерДлина КАК ПолезныйРазмерДлина,
	               |	ВнешнийИсточник.ПолезныйРазмерШирина КАК ПолезныйРазмерШирина,
	               |	ВнешнийИсточник.ВместимостьВКМ КАК ВместимостьВКМ,
	               |	ВнешнийИсточник.ГрузоподъемностьВТоннах КАК ГрузоподъемностьВТоннах
	               |ПОМЕСТИТЬ ВнешнийИсточник
	               |ИЗ
	               |	&ТЗ КАК ВнешнийИсточник
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОбъектРемонта,
	               |	КодРодителя,
	               |	КодРемонтирующегоПодразделения,
	               |	КодЭксплуатирующегоПодразделения,
	               |	ПлановыйГрафикРабот,
	               |	КодТиповогоОР,
	               |	Модель,
	               |	Приоритет,
	               |	ИзготовительСтр
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_ОбъектыРемонта.Ссылка КАК Ссылка,
	               |	торо_ОбъектыРемонта.Код КАК Код
	               |ПОМЕСТИТЬ ОбъектыРемонта
	               |ИЗ
	               |	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Код
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_ТиповыеОР.Ссылка КАК Ссылка,
	               |	торо_ТиповыеОР.Код КАК Код
	               |ПОМЕСТИТЬ ТиповыеОР
	               |ИЗ
	               |	Справочник.торо_ТиповыеОР КАК торо_ТиповыеОР
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Код
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СтруктураПредприятия.Ссылка КАК Ссылка,
	               |	СтруктураПредприятия.Код КАК Код
	               |ПОМЕСТИТЬ СтруктураПредприятия
	               |ИЗ
	               |	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Код
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Производители.Ссылка КАК Ссылка,
	               |	Производители.Наименование КАК Наименование
	               |ПОМЕСТИТЬ Производители
	               |ИЗ
	               |	Справочник.Производители КАК Производители
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Наименование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	проф_МоделиТСиОборудования.Ссылка КАК Ссылка,
	               |	проф_МоделиТСиОборудования.Наименование КАК Наименование
	               |ПОМЕСТИТЬ проф_МоделиТСиОборудования
	               |ИЗ
	               |	Справочник.проф_МоделиТСиОборудования КАК проф_МоделиТСиОборудования
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Наименование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВнешнийИсточник.ОбъектРемонта КАК ОбъектРемонтаКод,
	               |	ВнешнийИсточник.НаименованиеОР КАК НаименованиеОР,
	               |	ВнешнийИсточник.НаименованиеРодителя КАК НаименованиеРодителя,
	               |	ВнешнийИсточник.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	               |	ВнешнийИсточник.ДатаВыпуска КАК ДатаВыпуска,
	               |	ВнешнийИсточник.ТехНомер КАК ТехНомер,
	               |	ВнешнийИсточник.АдресМестонахождения КАК АдресМестонахождения,
	               |	ВнешнийИсточник.ЗаводскойНомер КАК ЗаводскойНомер,
	               |	ВнешнийИсточник.ИнвентарныйНомер КАК ИнвентарныйНомер,
	               |	ВнешнийИсточник.НомерПаспорта КАК НомерПаспорта,
	               |	ВнешнийИсточник.НаименованиеЭксплуатирующегоПодразделения КАК НаименованиеЭксплуатирующегоПодразделения,
	               |	ВнешнийИсточник.НаименованиеРемонтирующегоПодразделения КАК НаименованиеРемонтирующегоПодразделения,
	               |	ВнешнийИсточник.НаименованиеТиповогоОР КАК НаименованиеТиповогоОР,
	               |	ВнешнийИсточник.Модель КАК МодельНаименование,
	               |	ВнешнийИсточник.Марка КАК Марка,
	               |	ВнешнийИсточник.Гараж КАК Гараж,
	               |	ВнешнийИсточник.ГаражныйНомер КАК ГаражныйНомер,
	               |	ВнешнийИсточник.ВИН КАК ВИН,
	               |	ВнешнийИсточник.ГосНомер КАК ГосНомер,
	               |	ВнешнийИсточник.ЦветКузова КАК ЦветКузова,
	               |	ВнешнийИсточник.СобственныйВес КАК СобственныйВес,
	               |	ВнешнийИсточник.ИзготовительСтр КАК ИзготовительСтр,
	               |	ВнешнийИсточник.Колонна КАК Колонна,
	               |	ВнешнийИсточник.ВидЛицензионнойКарточки КАК ВидЛицензионнойКарточки,
	               |	ВнешнийИсточник.НомерЛицКарточки КАК НомерЛицКарточки,
	               |	ВнешнийИсточник.РегистрационныйНомерЛицКарточки КАК РегистрационныйНомерЛицКарточки,
	               |	ВнешнийИсточник.СерияЛицКарточки КАК СерияЛицКарточки,
	               |	ВнешнийИсточник.НомерДвигателя КАК НомерДвигателя,
	               |	ВнешнийИсточник.МодельДвигателя КАК МодельДвигателя,
	               |	ВнешнийИсточник.МощностьДвигателяКВТ КАК МощностьДвигателяКВТ,
	               |	ВнешнийИсточник.МощностьДвигателяЛС КАК МощностьДвигателяЛС,
	               |	ВнешнийИсточник.НомерКузова КАК НомерКузова,
	               |	ВнешнийИсточник.НомерШасси КАК НомерШасси,
	               |	ВнешнийИсточник.НомерКПП КАК НомерКПП,
	               |	ВнешнийИсточник.ГабаритныйРазмерДлина КАК ГабаритныйРазмерДлина,
	               |	ВнешнийИсточник.ГабаритныйРазмерШирина КАК ГабаритныйРазмерШирина,
	               |	ВнешнийИсточник.ГабаритныйРазмерВысота КАК ГабаритныйРазмерВысота,
	               |	ВнешнийИсточник.ПолезныйРазмерВысота КАК ПолезныйРазмерВысота,
	               |	ВнешнийИсточник.ПолезныйРазмерДлина КАК ПолезныйРазмерДлина,
	               |	ВнешнийИсточник.ПолезныйРазмерШирина КАК ПолезныйРазмерШирина,
	               |	ВнешнийИсточник.ВместимостьВКМ КАК ВместимостьВКМ,
	               |	ВнешнийИсточник.ГрузоподъемностьВТоннах КАК ГрузоподъемностьВТоннах,
	               |	ВнешнийИсточник.ПлановыйГрафикРабот КАК ПлановыйГрафикРабот,
	               |	ВнешнийИсточник.Приоритет КАК Приоритет,
	               |	ВнешнийИсточник.КодТиповогоОР КАК КодТиповогоОР,
	               |	ВнешнийИсточник.КодЭксплуатирующегоПодразделения КАК КодЭксплуатирующегоПодразделения,
	               |	ВнешнийИсточник.КодРемонтирующегоПодразделения КАК КодРемонтирующегоПодразделения,
	               |	ВнешнийИсточник.Модель КАК Модель,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(ОбъектыРемонта.Ссылка, НЕОПРЕДЕЛЕНО)) КАК ОбъектРемонтаКолВо,
	               |	МАКСИМУМ(ЕСТЬNULL(ОбъектыРемонта.Ссылка, НЕОПРЕДЕЛЕНО)) КАК ОбъектРемонта,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(ОбъектыРемонтаГруппы.Ссылка, НЕОПРЕДЕЛЕНО)) КАК РодительКолВо,
	               |	МАКСИМУМ(ЕСТЬNULL(ОбъектыРемонтаГруппы.Ссылка, НЕОПРЕДЕЛЕНО)) КАК Родитель,
	               |	ВнешнийИсточник.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ВнешнийИсточник2
	               |ИЗ
	               |	ВнешнийИсточник КАК ВнешнийИсточник
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ОбъектыРемонта КАК ОбъектыРемонта
	               |		ПО ВнешнийИсточник.ОбъектРемонта = ОбъектыРемонта.Код
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ОбъектыРемонта КАК ОбъектыРемонтаГруппы
	               |		ПО ВнешнийИсточник.КодРодителя = ОбъектыРемонтаГруппы.Код
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВнешнийИсточник.НомерСтроки,
	               |	ВнешнийИсточник.ОбъектРемонта,
	               |	ВнешнийИсточник.ПлановыйГрафикРабот,
	               |	ВнешнийИсточник.КодТиповогоОР,
	               |	ВнешнийИсточник.Приоритет,
	               |	ВнешнийИсточник.КодЭксплуатирующегоПодразделения,
	               |	ВнешнийИсточник.КодРемонтирующегоПодразделения,
	               |	ВнешнийИсточник.ИзготовительСтр,
	               |	ВнешнийИсточник.Модель,
	               |	ВнешнийИсточник.НаименованиеОР,
	               |	ВнешнийИсточник.НаименованиеРодителя,
	               |	ВнешнийИсточник.ДатаВводаВЭксплуатацию,
	               |	ВнешнийИсточник.ДатаВыпуска,
	               |	ВнешнийИсточник.ТехНомер,
	               |	ВнешнийИсточник.АдресМестонахождения,
	               |	ВнешнийИсточник.ЗаводскойНомер,
	               |	ВнешнийИсточник.ИнвентарныйНомер,
	               |	ВнешнийИсточник.НомерПаспорта,
	               |	ВнешнийИсточник.НаименованиеЭксплуатирующегоПодразделения,
	               |	ВнешнийИсточник.НаименованиеРемонтирующегоПодразделения,
	               |	ВнешнийИсточник.НаименованиеТиповогоОР,
	               |	ВнешнийИсточник.Марка,
	               |	ВнешнийИсточник.Гараж,
	               |	ВнешнийИсточник.ГаражныйНомер,
	               |	ВнешнийИсточник.ВИН,
	               |	ВнешнийИсточник.ГосНомер,
	               |	ВнешнийИсточник.ЦветКузова,
	               |	ВнешнийИсточник.СобственныйВес,
	               |	ВнешнийИсточник.Колонна,
	               |	ВнешнийИсточник.ВидЛицензионнойКарточки,
	               |	ВнешнийИсточник.НомерЛицКарточки,
	               |	ВнешнийИсточник.РегистрационныйНомерЛицКарточки,
	               |	ВнешнийИсточник.СерияЛицКарточки,
	               |	ВнешнийИсточник.НомерДвигателя,
	               |	ВнешнийИсточник.МодельДвигателя,
	               |	ВнешнийИсточник.МощностьДвигателяКВТ,
	               |	ВнешнийИсточник.МощностьДвигателяЛС,
	               |	ВнешнийИсточник.НомерКузова,
	               |	ВнешнийИсточник.НомерШасси,
	               |	ВнешнийИсточник.НомерКПП,
	               |	ВнешнийИсточник.ГабаритныйРазмерДлина,
	               |	ВнешнийИсточник.ГабаритныйРазмерШирина,
	               |	ВнешнийИсточник.ГабаритныйРазмерВысота,
	               |	ВнешнийИсточник.ПолезныйРазмерВысота,
	               |	ВнешнийИсточник.ПолезныйРазмерДлина,
	               |	ВнешнийИсточник.ПолезныйРазмерШирина,
	               |	ВнешнийИсточник.ВместимостьВКМ,
	               |	ВнешнийИсточник.ГрузоподъемностьВТоннах,
	               |	ВнешнийИсточник.Модель
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВнешнийИсточник.ОбъектРемонтаКод КАК ОбъектРемонтаКод,
	               |	ВнешнийИсточник.ОбъектРемонтаКолВо КАК ОбъектРемонтаКолВо,
	               |	ВнешнийИсточник.ОбъектРемонта КАК ОбъектРемонта,
	               |	ВнешнийИсточник.РодительКолВо КАК РодительКолВо,
	               |	ВнешнийИсточник.Родитель КАК Родитель,
	               |	ВнешнийИсточник.НаименованиеОР КАК НаименованиеОР,
	               |	ВнешнийИсточник.НаименованиеРодителя КАК НаименованиеРодителя,
	               |	ВнешнийИсточник.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	               |	ВнешнийИсточник.ДатаВыпуска КАК ДатаВыпуска,
	               |	ВнешнийИсточник.ТехНомер КАК ТехНомер,
	               |	ВнешнийИсточник.АдресМестонахождения КАК АдресМестонахождения,
	               |	ВнешнийИсточник.ЗаводскойНомер КАК ЗаводскойНомер,
	               |	ВнешнийИсточник.ИнвентарныйНомер КАК ИнвентарныйНомер,
	               |	ВнешнийИсточник.НомерПаспорта КАК НомерПаспорта,
	               |	ВнешнийИсточник.НаименованиеЭксплуатирующегоПодразделения КАК НаименованиеЭксплуатирующегоПодразделения,
	               |	ВнешнийИсточник.НаименованиеРемонтирующегоПодразделения КАК НаименованиеРемонтирующегоПодразделения,
	               |	ВнешнийИсточник.НаименованиеТиповогоОР КАК НаименованиеТиповогоОР,
	               |	ВнешнийИсточник.Модель КАК МодельНаименование,
	               |	ВнешнийИсточник.Марка КАК Марка,
	               |	ВнешнийИсточник.Гараж КАК Гараж,
	               |	ВнешнийИсточник.ГаражныйНомер КАК ГаражныйНомер,
	               |	ВнешнийИсточник.ВИН КАК ВИН,
	               |	ВнешнийИсточник.ГосНомер КАК ГосНомер,
	               |	ВнешнийИсточник.ЦветКузова КАК ЦветКузова,
	               |	ВнешнийИсточник.СобственныйВес КАК СобственныйВес,
	               |	ВнешнийИсточник.ИзготовительСтр КАК ИзготовительСтр,
	               |	ВнешнийИсточник.Колонна КАК Колонна,
	               |	ВнешнийИсточник.ВидЛицензионнойКарточки КАК ВидЛицензионнойКарточки,
	               |	ВнешнийИсточник.НомерЛицКарточки КАК НомерЛицКарточки,
	               |	ВнешнийИсточник.РегистрационныйНомерЛицКарточки КАК РегистрационныйНомерЛицКарточки,
	               |	ВнешнийИсточник.СерияЛицКарточки КАК СерияЛицКарточки,
	               |	ВнешнийИсточник.НомерДвигателя КАК НомерДвигателя,
	               |	ВнешнийИсточник.МодельДвигателя КАК МодельДвигателя,
	               |	ВнешнийИсточник.МощностьДвигателяКВТ КАК МощностьДвигателяКВТ,
	               |	ВнешнийИсточник.МощностьДвигателяЛС КАК МощностьДвигателяЛС,
	               |	ВнешнийИсточник.НомерКузова КАК НомерКузова,
	               |	ВнешнийИсточник.НомерШасси КАК НомерШасси,
	               |	ВнешнийИсточник.НомерКПП КАК НомерКПП,
	               |	ВнешнийИсточник.ГабаритныйРазмерДлина КАК ГабаритныйРазмерДлина,
	               |	ВнешнийИсточник.ГабаритныйРазмерШирина КАК ГабаритныйРазмерШирина,
	               |	ВнешнийИсточник.ГабаритныйРазмерВысота КАК ГабаритныйРазмерВысота,
	               |	ВнешнийИсточник.ПолезныйРазмерВысота КАК ПолезныйРазмерВысота,
	               |	ВнешнийИсточник.ПолезныйРазмерДлина КАК ПолезныйРазмерДлина,
	               |	ВнешнийИсточник.ПолезныйРазмерШирина КАК ПолезныйРазмерШирина,
	               |	ВнешнийИсточник.ВместимостьВКМ КАК ВместимостьВКМ,
	               |	ВнешнийИсточник.ГрузоподъемностьВТоннах КАК ГрузоподъемностьВТоннах,
	               |	ВнешнийИсточник.ПлановыйГрафикРабот КАК ПлановыйГрафикРабот,
	               |	ВнешнийИсточник.Приоритет КАК Приоритет,
	               |	ВнешнийИсточник.КодТиповогоОР КАК КодТиповогоОР,
	               |	ВнешнийИсточник.Модель КАК Модель,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(СтруктураПредприятия.Ссылка, НЕОПРЕДЕЛЕНО)) КАК ПодразделениеКолВо,
	               |	МАКСИМУМ(ЕСТЬNULL(СтруктураПредприятия.Ссылка, НЕОПРЕДЕЛЕНО)) КАК Подразделение,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(СтруктураПредприятия2.Ссылка, НЕОПРЕДЕЛЕНО)) КАК РемонтирующееПодразделениеКолВо,
	               |	МАКСИМУМ(ЕСТЬNULL(СтруктураПредприятия2.Ссылка, НЕОПРЕДЕЛЕНО)) КАК РемонтирующееПодразделение,
	               |	ВнешнийИсточник.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ВнешнийИсточник3
	               |ИЗ
	               |	ВнешнийИсточник2 КАК ВнешнийИсточник
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СтруктураПредприятия КАК СтруктураПредприятия
	               |		ПО ВнешнийИсточник.КодЭксплуатирующегоПодразделения = СтруктураПредприятия.Код
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СтруктураПредприятия КАК СтруктураПредприятия2
	               |		ПО ВнешнийИсточник.КодРемонтирующегоПодразделения = СтруктураПредприятия2.Код
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВнешнийИсточник.НомерСтроки,
	               |	ВнешнийИсточник.ОбъектРемонтаКод,
	               |	ВнешнийИсточник.ОбъектРемонтаКолВо,
	               |	ВнешнийИсточник.ОбъектРемонта,
	               |	ВнешнийИсточник.РодительКолВо,
	               |	ВнешнийИсточник.Родитель,
	               |	ВнешнийИсточник.ПлановыйГрафикРабот,
	               |	ВнешнийИсточник.Приоритет,
	               |	ВнешнийИсточник.КодТиповогоОР,
	               |	ВнешнийИсточник.Модель,
	               |	ВнешнийИсточник.ИзготовительСтр,
	               |	ВнешнийИсточник.НаименованиеОР,
	               |	ВнешнийИсточник.НаименованиеРодителя,
	               |	ВнешнийИсточник.ДатаВводаВЭксплуатацию,
	               |	ВнешнийИсточник.ДатаВыпуска,
	               |	ВнешнийИсточник.ТехНомер,
	               |	ВнешнийИсточник.АдресМестонахождения,
	               |	ВнешнийИсточник.ЗаводскойНомер,
	               |	ВнешнийИсточник.ИнвентарныйНомер,
	               |	ВнешнийИсточник.НомерПаспорта,
	               |	ВнешнийИсточник.НаименованиеЭксплуатирующегоПодразделения,
	               |	ВнешнийИсточник.НаименованиеРемонтирующегоПодразделения,
	               |	ВнешнийИсточник.НаименованиеТиповогоОР,
	               |	ВнешнийИсточник.Марка,
	               |	ВнешнийИсточник.Гараж,
	               |	ВнешнийИсточник.ГаражныйНомер,
	               |	ВнешнийИсточник.ВИН,
	               |	ВнешнийИсточник.ГосНомер,
	               |	ВнешнийИсточник.ЦветКузова,
	               |	ВнешнийИсточник.СобственныйВес,
	               |	ВнешнийИсточник.Колонна,
	               |	ВнешнийИсточник.ВидЛицензионнойКарточки,
	               |	ВнешнийИсточник.НомерЛицКарточки,
	               |	ВнешнийИсточник.РегистрационныйНомерЛицКарточки,
	               |	ВнешнийИсточник.СерияЛицКарточки,
	               |	ВнешнийИсточник.НомерДвигателя,
	               |	ВнешнийИсточник.МодельДвигателя,
	               |	ВнешнийИсточник.МощностьДвигателяКВТ,
	               |	ВнешнийИсточник.МощностьДвигателяЛС,
	               |	ВнешнийИсточник.НомерКузова,
	               |	ВнешнийИсточник.НомерШасси,
	               |	ВнешнийИсточник.НомерКПП,
	               |	ВнешнийИсточник.ГабаритныйРазмерДлина,
	               |	ВнешнийИсточник.ГабаритныйРазмерШирина,
	               |	ВнешнийИсточник.ГабаритныйРазмерВысота,
	               |	ВнешнийИсточник.ПолезныйРазмерВысота,
	               |	ВнешнийИсточник.ПолезныйРазмерДлина,
	               |	ВнешнийИсточник.ПолезныйРазмерШирина,
	               |	ВнешнийИсточник.ВместимостьВКМ,
	               |	ВнешнийИсточник.ГрузоподъемностьВТоннах,
	               |	ВнешнийИсточник.Модель
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВнешнийИсточник.ОбъектРемонтаКод КАК ОбъектРемонтаКод,
	               |	ВнешнийИсточник.ОбъектРемонтаКолВо КАК ОбъектРемонтаКолВо,
	               |	ВнешнийИсточник.ОбъектРемонта КАК ОбъектРемонта,
	               |	ВнешнийИсточник.РодительКолВо КАК РодительКолВо,
	               |	ВнешнийИсточник.Родитель КАК Родитель,
	               |	ВнешнийИсточник.ПодразделениеКолВо КАК ПодразделениеКолВо,
	               |	ВнешнийИсточник.РемонтирующееПодразделениеКолВо КАК РемонтирующееПодразделениеКолВо,
	               |	ВнешнийИсточник.РемонтирующееПодразделение КАК РемонтирующееПодразделение,
	               |	ВнешнийИсточник.Подразделение КАК Подразделение,
	               |	ВнешнийИсточник.НаименованиеОР КАК НаименованиеОР,
	               |	ВнешнийИсточник.НаименованиеРодителя КАК НаименованиеРодителя,
	               |	ВнешнийИсточник.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	               |	ВнешнийИсточник.ДатаВыпуска КАК ДатаВыпуска,
	               |	ВнешнийИсточник.ТехНомер КАК ТехНомер,
	               |	ВнешнийИсточник.АдресМестонахождения КАК АдресМестонахождения,
	               |	ВнешнийИсточник.ЗаводскойНомер КАК ЗаводскойНомер,
	               |	ВнешнийИсточник.ИнвентарныйНомер КАК ИнвентарныйНомер,
	               |	ВнешнийИсточник.НомерПаспорта КАК НомерПаспорта,
	               |	ВнешнийИсточник.НаименованиеЭксплуатирующегоПодразделения КАК НаименованиеЭксплуатирующегоПодразделения,
	               |	ВнешнийИсточник.НаименованиеРемонтирующегоПодразделения КАК НаименованиеРемонтирующегоПодразделения,
	               |	ВнешнийИсточник.НаименованиеТиповогоОР КАК НаименованиеТиповогоОР,
	               |	ВнешнийИсточник.Модель КАК МодельНаименование,
	               |	ВнешнийИсточник.Марка КАК Марка,
	               |	ВнешнийИсточник.Гараж КАК Гараж,
	               |	ВнешнийИсточник.ГаражныйНомер КАК ГаражныйНомер,
	               |	ВнешнийИсточник.ВИН КАК ВИН,
	               |	ВнешнийИсточник.ГосНомер КАК ГосНомер,
	               |	ВнешнийИсточник.ЦветКузова КАК ЦветКузова,
	               |	ВнешнийИсточник.СобственныйВес КАК СобственныйВес,
	               |	ВнешнийИсточник.ИзготовительСтр КАК ИзготовительСтр,
	               |	ВнешнийИсточник.Колонна КАК Колонна,
	               |	ВнешнийИсточник.ВидЛицензионнойКарточки КАК ВидЛицензионнойКарточки,
	               |	ВнешнийИсточник.НомерЛицКарточки КАК НомерЛицКарточки,
	               |	ВнешнийИсточник.РегистрационныйНомерЛицКарточки КАК РегистрационныйНомерЛицКарточки,
	               |	ВнешнийИсточник.СерияЛицКарточки КАК СерияЛицКарточки,
	               |	ВнешнийИсточник.НомерДвигателя КАК НомерДвигателя,
	               |	ВнешнийИсточник.МодельДвигателя КАК МодельДвигателя,
	               |	ВнешнийИсточник.МощностьДвигателяКВТ КАК МощностьДвигателяКВТ,
	               |	ВнешнийИсточник.МощностьДвигателяЛС КАК МощностьДвигателяЛС,
	               |	ВнешнийИсточник.НомерКузова КАК НомерКузова,
	               |	ВнешнийИсточник.НомерШасси КАК НомерШасси,
	               |	ВнешнийИсточник.НомерКПП КАК НомерКПП,
	               |	ВнешнийИсточник.ГабаритныйРазмерДлина КАК ГабаритныйРазмерДлина,
	               |	ВнешнийИсточник.ГабаритныйРазмерШирина КАК ГабаритныйРазмерШирина,
	               |	ВнешнийИсточник.ГабаритныйРазмерВысота КАК ГабаритныйРазмерВысота,
	               |	ВнешнийИсточник.ПолезныйРазмерВысота КАК ПолезныйРазмерВысота,
	               |	ВнешнийИсточник.ПолезныйРазмерДлина КАК ПолезныйРазмерДлина,
	               |	ВнешнийИсточник.ПолезныйРазмерШирина КАК ПолезныйРазмерШирина,
	               |	ВнешнийИсточник.ВместимостьВКМ КАК ВместимостьВКМ,
	               |	ВнешнийИсточник.ГрузоподъемностьВТоннах КАК ГрузоподъемностьВТоннах,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(Календари.Ссылка, НЕОПРЕДЕЛЕНО)) КАК ПлановыйГрафикРаботКолВо,
	               |	МАКСИМУМ(ЕСТЬNULL(Календари.Ссылка, НЕОПРЕДЕЛЕНО)) КАК ПлановыйГрафикРабот,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(ТиповыеОР.Ссылка, НЕОПРЕДЕЛЕНО)) КАК ТиповойОРКолВо,
	               |	МАКСИМУМ(ЕСТЬNULL(ТиповыеОР.Ссылка, НЕОПРЕДЕЛЕНО)) КАК ТиповойОР,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(проф_МоделиТСиОборудования.Ссылка, НЕОПРЕДЕЛЕНО)) КАК МодельКолВо,
	               |	МАКСИМУМ(ЕСТЬNULL(проф_МоделиТСиОборудования.Ссылка, НЕОПРЕДЕЛЕНО)) КАК Модель,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(торо_ПриоритетыОбъектовРемонта.Ссылка, НЕОПРЕДЕЛЕНО)) КАК ПриоритетКолВо,
	               |	МАКСИМУМ(ЕСТЬNULL(торо_ПриоритетыОбъектовРемонта.Ссылка, НЕОПРЕДЕЛЕНО)) КАК Приоритет,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(Производители.Ссылка, НЕОПРЕДЕЛЕНО)) КАК ИзготовительКолВо,
	               |	МАКСИМУМ(ЕСТЬNULL(Производители.Ссылка, НЕОПРЕДЕЛЕНО)) КАК Изготовитель,
	               |	ВнешнийИсточник.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	ВнешнийИсточник3 КАК ВнешнийИсточник
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Календари КАК Календари
	               |		ПО ВнешнийИсточник.ПлановыйГрафикРабот = Календари.Наименование
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ПриоритетыОбъектовРемонта КАК торо_ПриоритетыОбъектовРемонта
	               |		ПО ВнешнийИсточник.Приоритет = торо_ПриоритетыОбъектовРемонта.Наименование
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТиповыеОР КАК ТиповыеОР
	               |		ПО ВнешнийИсточник.КодТиповогоОР = ТиповыеОР.Код
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Производители КАК Производители
	               |		ПО ВнешнийИсточник.ИзготовительСтр = Производители.Наименование
	               |		ЛЕВОЕ СОЕДИНЕНИЕ проф_МоделиТСиОборудования КАК проф_МоделиТСиОборудования
	               |		ПО ВнешнийИсточник.Модель = проф_МоделиТСиОборудования.Наименование
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВнешнийИсточник.НомерСтроки,
	               |	ВнешнийИсточник.ОбъектРемонтаКод,
	               |	ВнешнийИсточник.ОбъектРемонтаКолВо,
	               |	ВнешнийИсточник.ОбъектРемонта,
	               |	ВнешнийИсточник.РодительКолВо,
	               |	ВнешнийИсточник.Родитель,
	               |	ВнешнийИсточник.ПодразделениеКолВо,
	               |	ВнешнийИсточник.РемонтирующееПодразделениеКолВо,
	               |	ВнешнийИсточник.РемонтирующееПодразделение,
	               |	ВнешнийИсточник.Подразделение,
	               |	ВнешнийИсточник.НаименованиеОР,
	               |	ВнешнийИсточник.НаименованиеРодителя,
	               |	ВнешнийИсточник.ДатаВводаВЭксплуатацию,
	               |	ВнешнийИсточник.ДатаВыпуска,
	               |	ВнешнийИсточник.ТехНомер,
	               |	ВнешнийИсточник.АдресМестонахождения,
	               |	ВнешнийИсточник.ЗаводскойНомер,
	               |	ВнешнийИсточник.ИнвентарныйНомер,
	               |	ВнешнийИсточник.НомерПаспорта,
	               |	ВнешнийИсточник.НаименованиеЭксплуатирующегоПодразделения,
	               |	ВнешнийИсточник.НаименованиеРемонтирующегоПодразделения,
	               |	ВнешнийИсточник.НаименованиеТиповогоОР,
	               |	ВнешнийИсточник.Модель,
	               |	ВнешнийИсточник.Марка,
	               |	ВнешнийИсточник.Гараж,
	               |	ВнешнийИсточник.ГаражныйНомер,
	               |	ВнешнийИсточник.ВИН,
	               |	ВнешнийИсточник.ГосНомер,
	               |	ВнешнийИсточник.ЦветКузова,
	               |	ВнешнийИсточник.СобственныйВес,
	               |	ВнешнийИсточник.ИзготовительСтр,
	               |	ВнешнийИсточник.Колонна,
	               |	ВнешнийИсточник.ВидЛицензионнойКарточки,
	               |	ВнешнийИсточник.НомерЛицКарточки,
	               |	ВнешнийИсточник.РегистрационныйНомерЛицКарточки,
	               |	ВнешнийИсточник.СерияЛицКарточки,
	               |	ВнешнийИсточник.НомерДвигателя,
	               |	ВнешнийИсточник.МодельДвигателя,
	               |	ВнешнийИсточник.МощностьДвигателяКВТ,
	               |	ВнешнийИсточник.МощностьДвигателяЛС,
	               |	ВнешнийИсточник.НомерКузова,
	               |	ВнешнийИсточник.НомерШасси,
	               |	ВнешнийИсточник.НомерКПП,
	               |	ВнешнийИсточник.ГабаритныйРазмерДлина,
	               |	ВнешнийИсточник.ГабаритныйРазмерШирина,
	               |	ВнешнийИсточник.ГабаритныйРазмерВысота,
	               |	ВнешнийИсточник.ПолезныйРазмерВысота,
	               |	ВнешнийИсточник.ПолезныйРазмерДлина,
	               |	ВнешнийИсточник.ПолезныйРазмерШирина,
	               |	ВнешнийИсточник.ВместимостьВКМ,
	               |	ВнешнийИсточник.ГрузоподъемностьВТоннах
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки УБЫВ";
	
	Запрос.УстановитьПараметр("ТЗ", ТЗ);			   
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Возврат РезультатЗапроса;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокОбязательныхКолонок()
	
	М = Новый Массив();
	М.Добавить(1); 
	М.Добавить(2);
	М.Добавить(5);
	М.Добавить(6);
	М.Добавить(14);
	М.Добавить(15);
		
	Возврат М;
	
КонецФункции

&НаСервере
Функция ПолучитьСпособУчетаДатыОтсчета(Наименование)
	
	Если Наименование = "По последнему ремонту или дате планирования" Тогда
		Возврат Перечисления.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот.ПоПоследнемуРемонтуИлиДатеПланирования;
		
	ИначеЕсли Наименование = "По дате ввода в эксплуатацию или последнему ремонту" Тогда
		Возврат Перечисления.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот.ИспользоватьДатуВводаВЭксплуатацию;
		
	ИначеЕсли Наименование = "Использовать дату планирования" Тогда
		Возврат Перечисления.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот.ИспользоватьДатуПланированияВКачествеДатыОтсчета;
		
	ИначеЕсли Наименование = "По последнему ремонту" Тогда
		Возврат Перечисления.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот.НеИспользоватьДатуВводаВЭксплуатацию;
		
	ИначеЕсли Наименование = "По дате ввода в эксплуатацию или плановым датам" Тогда
		Возврат Перечисления.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот.ПоДатеВводаВЭксплуатациюИлиПлановымДатам;   
		
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПроверитьДанные(МассивЭлементовСправочника,
								  СообщенияЗагрузки,
								  СообщениеОшибки,
								  СообщенияПредупреждения)
	
	ПриоритетПоУмолчанию = Справочники.проф_НастройкиСистемы.ПолучитьНастройкуСистемы(
								"НастройкиОбменаТОИР", "ПриоритетОбъектаРемонтаПоУмолчанию");
	
	Если ПриоритетПоУмолчанию = Неопределено
	Или Не ЗначениеЗаполнено(ПриоритетПоУмолчанию) Тогда
		ПриоритетПоУмолчанию = ПредопределенноеЗначение("Справочник.торо_ПриоритетыОбъектовРемонта.ПустаяСсылка");		
	КонецЕсли;
	
	ДополненныеДанные = ПолучитьДанныеДляПроверкиИЗаполнения();
	ЕстьНезаполненныеНаименованиеОР = Ложь;
	
	// Обработка данных и формирование массива записей регистра
	Пока ДополненныеДанные.Следующий() Цикл
		
		Стр = ДополненныеДанные;
						
		ПроверитьДополнительноДанные(Стр, СообщенияПредупреждения);
		Если ЕстьОшибкиПоОбязательнымИзмерениям(Стр, СообщенияПредупреждения) Тогда
			Продолжить;
		КонецЕсли;      
		
		ЗаполнитьСправочник(Стр, МассивЭлементовСправочника, ПриоритетПоУмолчанию);
		
	КонецЦикла;
	
	ВыполнитьЗаписьВБД(СообщенияЗагрузки, МассивЭлементовСправочника); 
    	
КонецПроцедуры	

&НаСервере
Процедура ПроверитьДополнительноДанные(Стр, СообщенияПредупреждения)
	
	Если Стр.ПлановыйГрафикРабот = Неопределено Тогда				
		СообщенияПредупреждения = СтрШаблон("В строке №%1 не найдено значение обязательного" +
			" поля шаблона ""Плановый график работы""", Стр.НомерСтроки); 
		ЗаписатьСообщение(СообщенияПредупреждения, Стр.НомерСтроки, 2);    
	КонецЕсли; 
	
	Если Стр.ПлановыйГрафикРаботКолВо > 1 Тогда				
		СообщенияПредупреждения = СтрШаблон("В строке №%1 найдено более одного значения" +
			" для поля шаблона ""Плановый график работы""", Стр.НомерСтроки);   
		ЗаписатьСообщение(СообщенияПредупреждения, Стр.НомерСтроки, 2);  
	КонецЕсли;   
	
    Если Стр.РодительКолВо > 1 Тогда				
		СообщенияПредупреждения = СтрШаблон("В строке №%1 найдено более одного значения" +
			" для поля шаблона ""Код родителя ОР""", Стр.НомерСтроки); 
		ЗаписатьСообщение(СообщенияПредупреждения, Стр.НомерСтроки, 2);
	КонецЕсли;
	
	Если Стр.Родитель = Неопределено Тогда				
		СообщенияПредупреждения = СтрШаблон("В строке №%1 не найдено значение" +
			" поля шаблона ""Код родителя ОР""", Стр.НомерСтроки); 
		ЗаписатьСообщение(СообщенияПредупреждения, Стр.НомерСтроки, 2);
	КонецЕсли;

	Если Стр.ПодразделениеКолВо > 1 Тогда				
		СообщенияПредупреждения = СтрШаблон("В строке №%1 найдено более одного значения" +
			" для поля шаблона ""Код эксплуатирующего подразделения""", Стр.НомерСтроки); 
		ЗаписатьСообщение(СообщенияПредупреждения, Стр.НомерСтроки, 2);
	КонецЕсли;
	
	Если Стр.Подразделение = Неопределено Тогда				
		СообщенияПредупреждения = СтрШаблон("В строке №%1 не найдено значение обязательного" +
			" поля шаблона ""Код эксплуатирующего подразделения""", Стр.НомерСтроки); 
		ЗаписатьСообщение(СообщенияПредупреждения, Стр.НомерСтроки, 2);
	КонецЕсли;
	
	Если Стр.РемонтирующееПодразделениеКолВо > 1 Тогда				
		СообщенияПредупреждения = СтрШаблон("В строке №%1 найдено более одного значения" +
			" для поля шаблона ""Код ремонтирующего подразделения""", Стр.НомерСтроки); 
		ЗаписатьСообщение(СообщенияПредупреждения, Стр.НомерСтроки, 2);
	КонецЕсли;
	
	Если Стр.РемонтирующееПодразделение = Неопределено Тогда				
		СообщенияПредупреждения = СтрШаблон("В строке №%1 не найдено значение" +
			" поля шаблона ""Код ремонтирующего подразделения""", Стр.НомерСтроки); 
		ЗаписатьСообщение(СообщенияПредупреждения, Стр.НомерСтроки, 2);
	КонецЕсли;
	
	Если Стр.ТиповойОРКолВо > 1 Тогда				
		СообщенияПредупреждения = СтрШаблон("В строке №%1 найдено более одного значения" +
			" для поля шаблона ""Код типового объекта ремонта""", Стр.НомерСтроки); 
		ЗаписатьСообщение(СообщенияПредупреждения, Стр.НомерСтроки, 2);
	КонецЕсли;
	
	Если Стр.ТиповойОР = Неопределено Тогда				
		СообщенияПредупреждения = СтрШаблон("В строке №%1 не найдено значение" +
			" поля шаблона ""Код типового объекта ремонта""", Стр.НомерСтроки); 
		ЗаписатьСообщение(СообщенияПредупреждения, Стр.НомерСтроки, 2);
	КонецЕсли;	
	
	Если Стр.МодельКолВо > 1 Тогда				
		СообщенияПредупреждения = СтрШаблон("В строке №%1 найдено более одного значения" +
			" для поля шаблона ""Модель""", Стр.НомерСтроки); 
		ЗаписатьСообщение(СообщенияПредупреждения, Стр.НомерСтроки, 2);
	КонецЕсли;
	
	Если Стр.ИзготовительКолВо > 1 Тогда				
		СообщенияПредупреждения = СтрШаблон("В строке №%1 найдено более одного значения" +
			" для поля шаблона ""Изготовитель""", Стр.НомерСтроки); 
		ЗаписатьСообщение(СообщенияПредупреждения, Стр.НомерСтроки, 2);
	КонецЕсли;
	
	Если Стр.ПриоритетКолВо > 1 Тогда				
		СообщенияПредупреждения = СтрШаблон("В строке №%1 найдено более одного значения" +
			" для поля шаблона ""Критичность""", Стр.НомерСтроки); 
		ЗаписатьСообщение(СообщенияПредупреждения, Стр.НомерСтроки, 2);
	КонецЕсли;
	
	Если Стр.Приоритет = Неопределено Тогда				
		СообщенияПредупреждения = СтрШаблон("В строке №%1 не найдено значение" +
			" поля шаблона ""Критичность"". Будет использовано значение по умолчанию (Настройки системы (Проф-ИТ)).", Стр.НомерСтроки); 
		ЗаписатьСообщение(СообщенияПредупреждения, Стр.НомерСтроки, 2);
	КонецЕсли;

КонецПроцедуры	

&НаСервере
Функция ЕстьОшибкиПоОбязательнымИзмерениям(Стр, СообщенияПредупреждения)
	
	ЕстьОшибкаПоОбязательнымИзмерениям = Ложь;  
	
	Если Стр.ОбъектРемонтаКолВо > 1 Тогда				
		СообщенияПредупреждения = СтрШаблон("В строке №%1 найдено более одного значения" +
			" для поля шаблона ""Код объекта ремонта""", Стр.НомерСтроки);   
		ЗаписатьСообщение(СообщенияПредупреждения, Стр.НомерСтроки, 2);  
		ЕстьОшибкаПоОбязательнымИзмерениям = Истина;
	КонецЕсли;  
	
	Если Не ЗначениеЗаполнено(Стр.НаименованиеОР) Тогда				
		СообщенияПредупреждения = СтрШаблон("Запись из номера строки №%1 не загружена,"+
			" т.к. не заполнено поле ""Наименование объекта ремонта(узла)""", Стр.НомерСтроки); 
		ЗаписатьСообщение(СообщенияПредупреждения, Стр.НомерСтроки, 4);     
		ЕстьОшибкаПоОбязательнымИзмерениям = Истина;
	КонецЕсли; 
	
	Возврат ЕстьОшибкаПоОбязательнымИзмерениям;
	
КонецФункции	

#КонецОбласти

//-- Проф-ИТ, #33, Башинская А., 13.10.2023
